[
  {
    "title": "High Wave Alert - Tamil Nadu Coast",
    "analyst": "Dr. Priya Sharma",
    "reportType": "emergency_alert",
    "priority": "urgent",
    "affectedRegions": ["Tamil Nadu", "Puducherry"],
    "hazardTypes": ["High Waves", "Storm Surge"],
    "summary": "Severe weather conditions are generating waves of 4-5 meters along the Tamil Nadu coast. Immediate evacuation of low-lying coastal areas is recommended.",
    "detailedAnalysis": "Meteorological analysis based on INSAT-3DR satellite imagery and data from the SCATSAT-1 scatterometer indicates a deep depression, designated BOB 05, has rapidly intensified over the southwest Bay of Bengal. As of 06:00 UTC, the system is centered near 12.5°N latitude and 83.0°E longitude, approximately 300 km east-southeast of Chennai, and is tracking west-northwest at 15 km/h. Surface winds are sustained at 55-65 km/h, gusting to 75 km/h. The primary threat is the generation of exceptionally high-energy wind waves. Our wave models (IMD-WAM and INCOIS-Swell) predict that wave heights will increase to 4-5 meters by noon, reaching a peak of 5-6 meters by evening, particularly in the coastal districts of Nagapattinam, Cuddalore, and Villupuram. These are not just high swells but also short-period, chaotic waves with a period of 6-8 seconds, making them extremely powerful and dangerous for all marine craft. Furthermore, the strong onshore winds are expected to cause a storm surge of 0.5 to 1.0 meters above the astronomical tide, leading to the inundation of low-lying areas within 500 meters of the high tide line. Conditions are expected to remain critical for the next 36 hours.",
    "confidenceLevel": "high",
    "submittedAt": "2025-09-30T00:00:00.000Z",
    "validUntil": "2025-10-01T00:00:00.000Z",
    "attachments": 3,
    "isApproved": true
  },
  {
    "title": "Coastal Flooding Risk Assessment - Andhra Pradesh",
    "analyst": "Dr. Rajesh Kumar",
    "reportType": "risk_assessment",
    "priority": "high",
    "affectedRegions": ["Andhra Pradesh"],
    "hazardTypes": ["Coastal Flooding", "Storm Surge"],
    "summary": "Analysis of tidal patterns and weather forecasts indicates elevated risk of coastal flooding in Visakhapatnam and surrounding areas over the next 48 hours.",
    "detailedAnalysis": "The current risk is driven by a confluence of three factors: a perigean spring tide (King Tide), sustained strong onshore winds, and elevated sea levels due to the ongoing positive Indian Ocean Dipole (IOD) event. Tidal gauges at Visakhapatnam and Kakinada are predicted to reach 1.8 meters above chart datum. Simultaneously, a persistent high-pressure system over the central Bay of Bengal is driving southeasterly winds of 40-50 km/h directly onto the coast. This phenomenon, known as 'wind setup,' is expected to pile water against the coastline, adding an additional 0.5-0.7 meters to the sea level. Both GFS and ECMWF weather models concur on the persistence of these winds for at least the next 48 hours. Historical analysis of a similar event in October 2018, under comparable atmospheric and tidal conditions, led to significant flooding in the Godavari delta region, inundating several coastal villages and causing extensive damage to aquaculture ponds. We project a total water level rise of 0.5 to 1 meter above the highest astronomical tide, primarily affecting low-lying areas of Visakhapatnam, Kakinada, and the Krishna-Godavari delta region. The risk will be most acute during the high tide cycles occurring at approximately 11:30 and 23:45 local time.",
    "confidenceLevel": "medium",
    "submittedAt": "2025-09-30T00:00:00.000Z",
    "validUntil": "2025-10-02T00:00:00.000Z",
    "reviewedBy": "Commissioner K. Venkatesh",
    "reviewedAt": "2025-09-30T00:00:00.000Z",
    "attachments": 5,
    "isApproved": true
  },
  {
    "title": "Weekly Ocean Conditions Forecast",
    "analyst": "Dr. Meera Nair",
    "reportType": "forecast_update",
    "priority": "medium",
    "affectedRegions": ["Kerala", "Karnataka"],
    "hazardTypes": ["High Waves", "Swell Surge"],
    "summary": "Moderate wave conditions expected along the west coast. No immediate threats identified, but continued monitoring recommended.",
    "detailedAnalysis": "Wave data from offshore buoys and altimeter passes from the Sentinel-3 satellite confirm the arrival of long-period swells originating from intense storm activity in the South Indian Ocean, near the Kerguelen Islands, approximately 4,000 km away. These swells have a significant wave height of 2-3 meters and an unusually long period of 16-18 seconds. While not immediately dangerous for larger vessels, these swells will transform as they approach the coast, creating powerful surge and unpredictable conditions, particularly around rocky headlands like Varkala and harbor entrances such as Kochi and Mangalore. Small fishing vessels should exercise caution as the long swell period can create a false sense of calm between sets, followed by unexpectedly large waves. Normal precautions include ensuring all safety equipment is functional, avoiding night navigation for boats under 15 meters in length, and maintaining a safe distance from the coast, especially during high tide. The peak of the swell event is expected on Wednesday, with conditions gradually subsiding through Friday.",
    "confidenceLevel": "high",
    "submittedAt": "2025-09-30T00:00:00.000Z",
    "reviewedBy": "Director S. Krishnamurthy",
    "reviewedAt": "2025-09-30T00:00:00.000Z",
    "attachments": 2,
    "isApproved": true
  },
  {
    "title": "Cyclone Alert - Odisha and West Bengal Coast",
    "analyst": "Dr. Anand Joshi",
    "reportType": "emergency_alert",
    "priority": "urgent",
    "affectedRegions": ["Odisha", "West Bengal"],
    "hazardTypes": ["Cyclone", "Storm Surge", "Heavy Rainfall"],
    "summary": "A cyclonic storm is expected to make landfall between Puri and Kolkata in the next 72 hours. Widespread damage is anticipated.",
    "detailedAnalysis": "The system, currently classified as a Very Severe Cyclonic Storm, is located over the central Bay of Bengal and is undergoing rapid intensification, fueled by sea surface temperatures of 29-30°C and low vertical wind shear. The Joint Typhoon Warning Center (JTWC) and IMD models are in strong agreement on a north-northwestward track, with landfall projected between Puri (Odisha) and the Sundarbans (West Bengal) in approximately 72 hours. At landfall, the storm is projected to be an Extremely Severe Cyclonic Storm with maximum sustained wind speeds of 150-160 km/h, gusting up to 180 km/h. The most dangerous aspect is a projected storm surge of 2-3 meters above astronomical tide, which could penetrate several kilometers inland in the low-lying deltaic regions of both states. The storm's large size and slow forward speed will also lead to extremely heavy rainfall, with accumulations of over 300mm expected in coastal districts, leading to widespread flash flooding and riverine flooding. Evacuation of vulnerable coastal populations is critical.",
    "confidenceLevel": "high",
    "submittedAt": "2025-10-01T00:00:00.000Z",
    "validUntil": "2025-10-04T00:00:00.000Z",
    "attachments": 4,
    "isApproved": false
  },
  {
    "title": "Tsunami Watch - Andaman and Nicobar Islands",
    "analyst": "Dr. Sunita Rao",
    "reportType": "tsunami_watch",
    "priority": "high",
    "affectedRegions": ["Andaman and Nicobar Islands"],
    "hazardTypes": ["Tsunami"],
    "summary": "An earthquake of magnitude 7.8 in the Andaman Sea has triggered a tsunami watch for the islands. Waves are possible within the next few hours.",
    "detailedAnalysis": "Seismic data from the USGS and the Indian National Centre for Seismology confirms a significant undersea earthquake with a magnitude of 7.8 Mw occurred at 08:47 UTC. The epicenter was located at 10.2°N, 94.5°E, at a shallow depth of 25 km, which is a critical factor for tsunami generation. The quake occurred on the subduction interface between the Indian and Burmese plates, and the focal mechanism indicates thrust faulting, which is highly efficient at displacing large volumes of water. Our tsunami wave models (MOST - Method of Splitting Tsunami) are now running to predict potential impacts. Initial model runs, based on the seismic parameters, suggest a potential wave height of 1-2 meters for the Nicobar Islands and 0.5-1 meter for the Andaman Islands. The estimated first arrival time for Campbell Bay in Great Nicobar is approximately 45 minutes post-earthquake, with subsequent arrivals in Port Blair within 90 minutes. This watch is issued based on the seismic event alone; it will be upgraded to a warning or canceled based on observations from DART (Deep-ocean Assessment and Reporting of Tsunami) buoys in the region.",
    "confidenceLevel": "medium",
    "submittedAt": "2025-10-02T00:00:00.000Z",
    "validUntil": "2025-10-02T12:00:00.000Z",
    "attachments": 2,
    "isApproved": true
  },
  {
    "title": "Rip Current Advisory - Goa",
    "analyst": "Mr. Vikram Singh",
    "reportType": "advisory",
    "priority": "medium",
    "affectedRegions": ["Goa"],
    "hazardTypes": ["Rip Currents"],
    "summary": "Strong rip currents are expected along popular beaches in Goa. Swimmers are advised to exercise extreme caution.",
    "detailedAnalysis": "The current conditions are a classic setup for dangerous rip currents. A moderate groundswell with a period of 12-14 seconds is arriving perpendicular to the coastline. This swell energy is creating a wide surf zone with multiple breaking sandbars. The water pushed onto the shore by the waves is being channeled back out to sea through narrow, fast-moving currents. Our analysis of local bathymetry and beach morphology identifies high-risk areas at Calangute, Baga, and Palolem beaches, particularly near channels and breaks in the sandbars. These currents can flow at speeds exceeding 2 meters per second, faster than an Olympic swimmer. The risk is exacerbated during low tide, when the currents become more concentrated and powerful. Beachgoers are advised to swim only at patrolled beaches, look for signs of rip currents (such as a channel of churning, choppy water or a line of foam moving steadily seaward), and if caught in a current, to swim parallel to the shore until free of the current's pull.",
    "confidenceLevel": "high",
    "submittedAt": "2025-10-03T00:00:00.000Z",
    "validUntil": "2025-10-05T00:00:00.000Z",
    "attachments": 1,
    "isApproved": false
  },
  {
    "title": "Marine Ecosystem Health Report - Gulf of Mannar",
    "analyst": "Dr. Fatima Khan",
    "reportType": "environmental_assessment",
    "priority": "low",
    "affectedRegions": ["Tamil Nadu"],
    "hazardTypes": ["Coral Bleaching", "Pollution"],
    "summary": "Minor coral bleaching observed in the Gulf of Mannar. Water quality remains stable, but monitoring for pollution is ongoing.",
    "detailedAnalysis": "Our latest field survey and analysis of satellite-derived sea surface temperature (SST) data from NOAA's Coral Reef Watch program reveal minor but widespread coral bleaching. The bleaching is primarily affecting Acropora and Pocillopora species at depths of 2-5 meters. This corresponds to a period of 3-4 weeks where SSTs have been consistently 1.0-1.5°C above the long-term average, creating thermal stress on the corals. Currently, the bleaching is classified as Level 1 (pale coloration), not yet Level 2 (fully white), indicating the symbiotic zooxanthellae have not been fully expelled. Water quality parameters, including turbidity, dissolved oxygen, and nutrient levels (nitrates and phosphates), remain within acceptable limits for this time of year, suggesting that the primary stressor is thermal. No significant industrial or agricultural pollution has been detected in our water samples. We recommend continued monitoring; if SSTs do not decrease within the next two weeks, more severe bleaching and potential coral mortality could occur. This event serves as an early indicator of the region's vulnerability to climate change.",
    "confidenceLevel": "high",
    "submittedAt": "2025-10-04T00:00:00.000Z",
    "reviewedBy": "Dr. Meera Nair",
    "reviewedAt": "2025-10-04T12:00:00.000Z",
    "attachments": 6,
    "isApproved": true
  },
  {
    "title": "High Tide Flooding Warning - Mumbai",
    "analyst": "Dr. Rajesh Kumar",
    "reportType": "warning",
    "priority": "high",
    "affectedRegions": ["Maharashtra"],
    "hazardTypes": ["Coastal Flooding"],
    "summary": "King tides combined with monsoon rainfall are expected to cause flooding in low-lying areas of Mumbai.",
    "detailedAnalysis": "A confluence of meteorological and astronomical events is creating a high probability of significant coastal flooding. Tidal predictions indicate a perigean spring tide (King Tide) peaking at 4.9 meters at 13:30 local time. This is one of the highest tides of the year. Concurrently, the southwest monsoon is active over the region, with the IMD forecasting a period of heavy to very heavy rainfall (60-120 mm in 24 hours) coinciding with the high tide. This rainfall will saturate the urban drainage system. The high tide will prevent the city's storm water drains, which empty into the sea, from discharging effectively—a phenomenon known as 'tide-locking.' This will cause rainwater to back up and lead to severe waterlogging in low-lying areas such as Hindmata, Dadar, and parts of Kurla. The situation is further compounded by a projected storm surge of 0.3-0.5 meters due to strong southwesterly winds. The combined effect of rain, tide, and surge is likely to overwhelm the city's drainage capacity, leading to flooding of 1-2 feet in vulnerable areas.",
    "confidenceLevel": "high",
    "submittedAt": "2025-10-05T00:00:00.000Z",
    "validUntil": "2025-10-06T00:00:00.000Z",
    "attachments": 3,
    "isApproved": true
  },
  {
    "title": "Fisheries Advisory - Gujarat Coast",
    "analyst": "Mr. Sanjay Patel",
    "reportType": "advisory",
    "priority": "medium",
    "affectedRegions": ["Gujarat"],
    "hazardTypes": ["Rough Seas"],
    "summary": "Fishermen are advised not to venture into the sea for the next 48 hours due to rough sea conditions.",
    "detailedAnalysis": "A well-marked low-pressure system has formed over the northeast Arabian Sea, approximately 400 km southwest of Porbandar. This system is causing a significant strengthening of the pressure gradient over the Gujarat coast, resulting in strong southwesterly winds of 45-55 km/h, with gusts reaching 65 km/h. These strong winds are generating rough to very rough sea conditions, with wave heights of 3-4 meters expected along the entire coast from Jakhau to Veraval. The combination of high wind and steep, short-period waves makes fishing operations, especially for smaller vessels, extremely unsafe. There is a high risk of boats capsizing. The advisory is in effect for the next 48 hours, as the low-pressure system is slow-moving and expected to persist. Fishermen who are already at sea are advised to return to the nearest safe harbor immediately. Port authorities have been instructed to hoist the appropriate warning signals.",
    "confidenceLevel": "high",
    "submittedAt": "2025-10-06T00:00:00.000Z",
    "validUntil": "2025-10-08T00:00:00.000Z",
    "attachments": 1,
    "isApproved": true
  },
  {
    "title": "Coastal Erosion Assessment - Kerala",
    "analyst": "Dr. Priya Sharma",
    "reportType": "risk_assessment",
    "priority": "medium",
    "affectedRegions": ["Kerala"],
    "hazardTypes": ["Coastal Erosion"],
    "summary": "Increased rates of coastal erosion observed in Alappuzha district. Long-term mitigation measures should be considered.",
    "detailedAnalysis": "Analysis of high-resolution satellite imagery (from Sentinel-2 and Planet Labs) from the past 12 months shows an alarming acceleration in coastal erosion rates in the Alappuzha district, particularly in the coastal stretches of Chellanam and Ottamassery. We have measured an average shoreline retreat of 2 meters over the past year, with localized hotspots showing over 5 meters of loss. This rate is significantly higher than the historical average of 0.5 meters per year for this region. The erosion has been exacerbated by the recent active monsoon season, which brought a series of high-energy wave events. Furthermore, the construction of coastal structures updrift has likely interrupted the natural longshore sediment transport, starving these beaches of their sand supply. This assessment indicates a chronic erosion problem that requires immediate attention. Without intervention, critical infrastructure, including homes and roads, will be threatened within the next 3-5 years. We recommend commissioning a detailed study for the implementation of long-term, sustainable mitigation measures, such as beach nourishment, offshore breakwaters, or ecosystem-based solutions like mangrove restoration.",
    "confidenceLevel": "medium",
    "submittedAt": "2025-10-07T00:00:00.000Z",
    "reviewedBy": "Director S. Krishnamurthy",
    "reviewedAt": "2025-10-07T12:00:00.000Z",
    "attachments": 4,
    "isApproved": false
  },
  {
    "title": "Swell Surge Forecast - Lakshadweep",
    "analyst": "Dr. Meera Nair",
    "reportType": "forecast_update",
    "priority": "low",
    "affectedRegions": ["Lakshadweep"],
    "hazardTypes": ["Swell Surge"],
    "summary": "Minor swell surge expected, with wave run-up of 0.5 meters. No significant impact on coastal communities is anticipated.",
    "detailedAnalysis": "Long-period swells (18-20 seconds) generated by a powerful storm system in the southern Indian Ocean are propagating northwards and are expected to reach the Lakshadweep archipelago. While the deep-water swell height is only 1-1.5 meters, the long period of these waves means they carry significant energy. As they interact with the steep bathymetry of the atolls, this energy will be converted into wave run-up on the beaches, a phenomenon known as 'swell surge' or 'infragravity waves'. Our models predict a wave run-up of approximately 0.5 meters above the predicted tide level, which may cause minor inundation of the lowest-lying areas of atolls like Kavaratti, Agatti, and Minicoy, particularly on their exposed, ocean-facing shorelines. This is not expected to cause significant damage or threaten lives, but residents should take basic precautions, such as securing small boats and moving equipment away from the immediate shoreline. The event is forecast to peak during the high tide on Thursday morning and will gradually subside over the following 48 hours.",
    "confidenceLevel": "high",
    "submittedAt": "2025-10-08T00:00:00.000Z",
    "validUntil": "2025-10-10T00:00:00.000Z",
    "attachments": 2,
    "isApproved": true
  },
  {
    "title": "Harmful Algal Bloom Watch - Karnataka Coast",
    "analyst": "Dr. Anand Joshi",
    "reportType": "environmental_watch",
    "priority": "medium",
    "affectedRegions": ["Karnataka"],
    "hazardTypes": ["Harmful Algal Bloom"],
    "summary": "Conditions are favorable for a harmful algal bloom (HAB) along the coast near Mangalore. Water samples are being tested.",
    "detailedAnalysis": "A combination of environmental factors has created conditions highly conducive to the formation of a harmful algal bloom (HAB), specifically the dinoflagellate Noctiluca scintillans (sea sparkle). Recent satellite ocean color imagery (from Sentinel-3 OLCI) shows high chlorophyll-a concentrations, a proxy for phytoplankton biomass. This follows a period of heavy monsoon runoff, which has likely introduced elevated levels of nutrients (nitrates and phosphates) from agricultural areas into coastal waters. Furthermore, sea surface temperatures are currently 1-2°C above average, which can accelerate bloom formation. Water samples collected from nearshore waters off Mangalore are currently being analyzed in the lab to confirm the species and cell density. If a dense bloom forms, it can lead to hypoxic (low oxygen) conditions as the algae die and decompose, potentially causing fish kills. While Noctiluca is not typically toxic to humans, it can cause skin and respiratory irritation. We are issuing this watch to alert fisheries and public health officials to the potential for a bloom in the coming days.",
    "confidenceLevel": "medium",
    "submittedAt": "2025-10-09T00:00:00.000Z",
    "attachments": 3,
    "isApproved": true
  },
  {
    "title": "Port Operations Advisory - Chennai Port",
    "analyst": "Mr. Vikram Singh",
    "reportType": "advisory",
    "priority": "medium",
    "affectedRegions": ["Tamil Nadu"],
    "hazardTypes": ["Strong Currents", "High Winds"],
    "summary": "Strong currents and gusty winds may impact vessel navigation and cargo operations at Chennai Port. Delays are possible.",
    "detailedAnalysis": "The remnants of the weather system BOB 05, now a weak low-pressure area, are causing unstable conditions in and around Chennai Port. Although the system has weakened, it is still generating a strong pressure gradient, leading to gusty southwesterly winds of 25-30 knots (45-55 km/h) within the port's breakwaters. These winds can make berthing and unberthing maneuvers for large container vessels challenging. More significantly, our hydrodynamic models and real-time data from the port's Acoustic Doppler Current Profiler (ADCP) show unpredictable cross-currents in the main navigation channel, with speeds reaching up to 3 knots. These currents can affect a vessel's ability to maintain its intended track, increasing the risk of grounding or collision. Crane operations for loading and unloading cargo may also be suspended if wind gusts exceed safety thresholds. Vessel pilots and terminal operators are advised to exercise extreme caution. Delays in vessel turnaround time are likely for the next 24 hours until the local effects of the weather system fully dissipate.",
    "confidenceLevel": "high",
    "submittedAt": "2025-10-10T00:00:00.000Z",
    "validUntil": "2025-10-11T00:00:00.000Z",
    "attachments": 1,
    "isApproved": true
  }
]
